; domain
(define
	(domain world-of-blocks)
	(:requirements :adl)
	(:predicates
		(on-top ?x ?y)
		(on-floor ?x)
		(clear ?x)
		(in-air ?x)
	)
	(:action podnies-z-podlogi
	    :parameters(?x)
	    :precondition
	    (and
	        (clear ?x)
	        (on-floor ?x)
	        (not(in-air ?x))
	        (forall (?y) (not (in-air ?y)))
	    )
	    :effect
	    (and
	       (not(on-floor ?X))
	       (not(clear ?x))
	       (in-air ?x)
	    )
	)
	(:action podnies-z-paczki
	    :parameters(?x ?z)
	    :precondition
	    (and
	        (clear ?x)
	        (on-top ?x ?z)
	        (not(in-air ?x))
	        (forall (?y) (not (in-air ?y)))
	    )
	    :effect
	    (and
	       (not(clear ?x))
	       (clear ?z)
	       (in-air ?x)
	       (not(on-top ?x ?z))
	    )
	)
	(:action opusc-na-podloge
	    :parameters (?x)
	    :precondition
	    (and
	        (in-air ?x)
	    )
	    :effect
	    (and
	        (not(in-air ?x))
	        (clear ?x)
	        (on-floor ?x)
	    )
	)
	(:action opusc-na-paczke
	    :parameters (?z ?x)
        :precondition
        (and
            (in-air ?x)
            (clear ?z)
        )
        :effect
        (and
            (not(in-air ?x))
            (not(clear ?z))
            (clear ?x)
            (on-top ?x ?z)
            (not(on-floor ?x))
        )
	)
)

; problem
(define (problem p1)
    (:domain world-of-blocks)
    (:objects a b c d e f)
    
    (:init
        (on-floor a) (clear a)
        (on-floor b) (clear b)
        (on-floor c) (clear c)
        (on-floor d) (clear d)
        (on-floor e) (clear e)
        (on-floor f) (clear f)
    )
    
    (:goal
        (and
            (forall (?y) (not (in-air ?y)))
            (on-floor a) (not(clear a))
            (not(on-floor b)) (not(clear b))
            (not(on-floor c)) (not(clear c))
            (not(on-floor d)) (not(clear d))
            (not(on-floor e)) (not(clear d))
            (not(on-floor f))
        )
    )
)

; plan
1. (podnies-z-podlogi d)
   deleted: (on-floor d) (clear d)
   added: (in-air d)
   goals met: 4 of 12
2. (opusc-na-paczke a d)
   deleted: (in-air d) (clear a)
   added: (clear d) (on-top d a)
   goals met: 4 of 12
3. (podnies-z-podlogi c)
   deleted: (on-floor c) (clear c)
   added: (in-air c)
   goals met: 5 of 12
4. (opusc-na-paczke d c)
   deleted: (in-air c) (clear d)
   added: (clear c) (on-top c d)
   goals met: 7 of 12
5. (podnies-z-podlogi b)
   deleted: (on-floor b) (clear b)
   added: (in-air b)
   goals met: 8 of 12
6. (opusc-na-paczke c b)
   deleted: (in-air b) (clear c)
   added: (clear b) (on-top b c)
   goals met: 9 of 12
7. (podnies-z-podlogi f)
   deleted: (on-floor f) (clear f)
   added: (in-air f)
   goals met: 9 of 12
8. (opusc-na-paczke b f)
   deleted: (in-air f) (clear b)
   added: (clear f) (on-top f b)
   goals met: 11 of 12
9. (podnies-z-podlogi e)
   deleted: (on-floor e) (clear e)
   added: (in-air e)
   goals met: 11 of 12
10. (opusc-na-paczke f e)
   deleted: (in-air e) (clear f)
   added: (clear e) (on-top e f)
   goals met: 12 of 12
